#include <stdio.h>

int CheckTrue(void);

int main(void)
{
	int r;
	puts("isalnum()");
	puts("1.字母 2.字母数字 3.数字");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 2)?"正确!":"错误！");
	puts("isalnum()参数为字母数字时返回值为真！");
	puts("----------------------------------------------------");
	puts("isalpha()");
	puts("1.字母 2.字母数字 3.数字");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 1)?"正确!":"错误！");
	puts("isalpha()参数为字母时返回值为真！");
	puts("----------------------------------------------------");
	puts("isdigit()");
	puts("1.字母 2.字母数字 3.数字");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 3)?"正确!":"错误！");
	puts("isdigit()参数为数字时返回值为真！");
	puts("----------------------------------------------------");
	puts("isblank()");
	puts("1.标准空白字符 2.仅空格符 3.标点符号");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 1)?"正确!":"错误！");
	puts("isblank()参数为标准空白字符时返回值为真！");
	puts("----------------------------------------------------");
	puts("iscntrl()");
	puts("1.标准空白符 2.控制字符Ctrl+B 3.小写字母");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 2)?"正确!":"错误！");
	puts("iscntrl()参数为控制字符时返回值为真！");
	puts("----------------------------------------------------");
	puts("isgraph()");
	puts("1.除空格之外任意可打印字符 2.控制字符Ctrl+B 3.除字符之外任意可打印字符");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 1)?"正确!":"错误！");
	puts("isgraph()参数为除空格之外任意可打印字符时返回值为真！");
	puts("----------------------------------------------------");
	puts("islower()");
	puts("1.大写字母 2.小写字母 3.除字符之外任意可打印字符");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 2)?"正确!":"错误！");
	puts("islower()参数为小写字母时返回值为真！");
	puts("----------------------------------------------------");
	puts("isupper()");
	puts("1.大写字母 2.小写字母 3.除字符之外任意可打印字符");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 1)?"正确!":"错误！");
	puts("isupper()参数为大写字母时返回值为真！");
	puts("----------------------------------------------------");
	puts("isprintf()");
	puts("1.不可打印字符 2.小写字母 3.可打印字符");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 3)?"正确!":"错误！");
	puts("isprintf()参数为可打印字符时返回值为真！");
	puts("----------------------------------------------------");
	puts("ispunct()");
	puts("1.数字 2.标点符号 3.可打印字符");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 2)?"正确!":"错误！");
	puts("ispunct()参数为标点符号时返回值为真！");
	puts("----------------------------------------------------");
	puts("isspace()");
	puts("1.空白字符 2.仅空格符 3.标点符号");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 1)?"正确!":"错误！");
	puts("isspace()参数为空白字符时返回值为真！");
	puts("----------------------------------------------------");
	puts("isxdigit()");
	puts("1.十进制数字符 2.仅空格符 3.十六进制数字符");
	r = CheckTrue();//验真值
	printf("回答%s\t", (r == 3)?"正确!":"错误！");
	puts("isxdigit()参数为十六进制数字符时返回值为真！");
	puts("----------------------------------------------------");

	return 0;
}

int CheckTrue()
{
	int n;

	while(scanf("%d", &n) != 1)//如果没有获取到数值则不停的获取，获取到数值则退出循环
	{
		while(getchar() != '\n')//获取缓冲区垃圾字符
			continue;//舍去垃圾字符
	}
	if(n > 0 && n < 4)
		return n;
	else
		return 0;
}
